In [1]:
# -------------------> DATE AND TIME FUNCTIONS & OPERATIONS IN SQL <-----------------------------------

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector as g
from tabulate import tabulate
import pandas as pd
mydb = g.connect(host = 'localhost',user = 'root',passwd = 'Loveumom@123')
cursor = mydb.cursor()

In [3]:
cursor.execute('SHOW DATABASES')

In [4]:
cursor.fetchall()

[('cardataset',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sidfirst',),
 ('sqlpractice1',),
 ('sys',)]

In [9]:
cursor.execute('USE sqlpractice1')
cursor.execute('SHOW TABLES')

In [10]:
print(tabulate(cursor.fetchall(),headers = ['TABLES IN sqlpractice1'],tablefmt = 'pretty'))

+------------------------+
| TABLES IN sqlpractice1 |
+------------------------+
|       employees        |
|   popular_databases    |
|   popular_languages    |
|        student         |
+------------------------+

In [7]:
cursor.execute("""
SELECT CURDATE(); 
""")
# OR SELECT CURRENT_DATE;

In [8]:
print(tabulate(cursor.fetchall(),headers = ['CURRENT DATE'],tablefmt = 'pretty'))

+--------------+
| CURRENT DATE |
+--------------+
|  2024-09-11  |
+--------------+

In [14]:
cursor.execute("""
SELECT CURTIME();
""")

In [15]:
print(tabulate(cursor.fetchall(),headers = ['CURRENT TIME'],tablefmt = 'pretty'))

+--------------+
| CURRENT TIME |
+--------------+
|   9:23:21    |
+--------------+

In [18]:
# -----> current time stamp means current date and time
cursor.execute("""
SELECT NOW();
""")
print(tabulate(cursor.fetchall(),headers = ['CURRENT DATE & TIME'],tablefmt = 'pretty')) # OR SELECT CURRENT_TIMESTAMP();

+---------------------+
| CURRENT DATE & TIME |
+---------------------+
| 2024-09-11 09:26:21 |
+---------------------+

In [20]:
cursor.execute("""
SELECT CURRENT_TIMESTAMP();
""")
print(tabulate(cursor.fetchall(),headers = ['CURRENT TIMESTAMP'],tablefmt = 'pretty'))

+---------------------+
|  CURRENT TIMESTAMP  |
+---------------------+
| 2024-09-11 09:27:16 |
+---------------------+

In [21]:
# Extract the date part from data or datetime expression
cursor.execute("""
SELECT DATE('2024-09-10 12:34:56');
""")

In [22]:
print(tabulate(cursor.fetchall(),headers = ['DATE'],tablefmt = 'pretty'))

+------------+
|    DATE    |
+------------+
| 2024-09-10 |
+------------+

In [26]:
# extract the part of the date such as date,month,year,hour,minutes,seconds etc.
cursor.execute("""
SELECT EXTRACT(YEAR FROM '2024-06-15');
""")

In [27]:
print(tabulate(cursor.fetchall(),headers = ['YEAR'],tablefmt = 'pretty'))

+------+
| YEAR |
+------+
| 2024 |
+------+

In [34]:
# DATE_ADD() to add specific interval to date (like adding days,or months,or year)
# Syntax : SELECT DATE_ADD(date_expression, INTERVAL value unit); value : 12,5,-7,-4 unit: day,month,year
cursor.execute("""
SELECT DATE_ADD('2022-09-10',INTERVAL -5 DAY);
""")

In [35]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+------------+
|   RESULT   |
+------------+
| 2022-09-05 |
+------------+

In [36]:
# DATE_SUB() to subtract specific time interval from a Date.
cursor.execute("""
SELECT DATE_SUB('2024-09-10', INTERVAL 5 MONTH);
""")

In [37]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+------------+
|   RESULT   |
+------------+
| 2024-04-10 |
+------------+

In [5]:
# DATEDIFF() : Returns the number of days between two dates.
# syntax : DATEDIIF(date1,date2); .... counting from date2 to date1
cursor.execute("""
SELECT DATEDIFF('2015-04-30','2015-01-30');
""")

In [6]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+--------+
| RESULT |
+--------+
|   90   |
+--------+

In [7]:
# STR_TO_DATE() : Converts a string into a date according to the specified format.
# syntax : SELECT STR_TO_DATE(string, format);
cursor.execute("""
SELECT STR_TO_DATE('10/09/2024', '%d/%m/%Y');
""")

In [8]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+------------+
|   RESULT   |
+------------+
| 2024-09-10 |
+------------+

In [11]:
# DATE_FORMAT() : Formats date according to specified format.
# syntax : SELECT DATE_FORMAT(date,format);
cursor.execute("""
SELECT DATE_FORMAT('2019-11-25','%d-%m-%Y');
""")

In [12]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+------------+
|   RESULT   |
+------------+
| 25-11-2019 |
+------------+

In [13]:
# DATE() : Extracts time from datetime expression
# syntax : DATE(datetime);
cursor.execute("""
SELECT TIME('2023-04-15 14:20:56')
""")

In [14]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+----------+
|  RESULT  |
+----------+
| 14:20:56 |
+----------+

In [26]:
#TIMESTAMPDIFF() : extracts timestamp difference between two time stamps in terms of hours,min,secs
# syntax : TIMESTAMPDIFF(unit,timestamp1,timestamp2);
cursor.execute("""
SELECT TIMESTAMPDIFF(HOUR,'2017-11-28 14:00:00','2017-11-30 22:00:00')
""")

In [27]:
print(tabulate(cursor.fetchall(),headers = ['RESULT'],tablefmt = 'pretty'))

+--------+
| RESULT |
+--------+
|   56   |
+--------+

In [33]:
# YEAR(),MONTH(),DAY() : Etracts specific part of date such as year,month,day
# syntax: SELECT YEAR(DATE),MONTH(DATE),DAY(DATE)
cursor.execute("""
SELECT YEAR('2024-02-13'),MONTH('2024-02-13'),DAY('2024-02-13')
""")

In [34]:
print(tabulate(cursor.fetchall(),headers = ['YEAR','MONTH','DAY'],tablefmt = 'pretty')) #########################

+------+-------+-----+
| YEAR | MONTH | DAY |
+------+-------+-----+
| 2024 |   2   | 13  |
+------+-------+-----+

In [35]:
# --------> CREATING TABLE AND DOING SOME PROBLEM SOLVING BASED ON ABOVE FUNCTIONS <--------------

In [5]:
cursor.execute("""
CREATE TABLE sqlpractice1.employees2 (
emp_id INT PRIMARY KEY,
name VARCHAR(50),
birth_date DATE,
hire_date DATE,
last_promotion TIMESTAMP
);
""")

In [6]:
cursor.execute("""
INSERT INTO sqlpractice1.employees2 (emp_id,name,birth_date,hire_date,last_promotion) VALUES
(1, 'Alice', '1985-06-15', '2015-09-10', '2021-09-01 10:00:00'),
(2, 'Bob', '1990-11-20', '2018-01-15', '2023-01-10 09:30:00'),
(3, 'Charlie', '1982-03-22', '2010-07-11', '2022-06-15 11:45:00'),
(4, 'David', '1995-07-30', '2020-12-01', '2023-06-30 14:15:00'),
(5, 'Eva', '1987-09-12', '2012-03-25', '2022-12-22 16:50:00'),
(6, 'Frank', '1988-04-18', '2016-06-22', '2023-05-10 12:00:00'),
(7, 'Grace', '1983-12-25', '2009-05-03', '2021-10-01 15:20:00'),
(8, 'Hannah', '1991-02-14', '2017-07-05', '2022-11-05 09:15:00'),
(9, 'Ivy', '1989-08-22', '2019-09-09', '2023-03-25 17:30:00'),
(10, 'Jake', '1992-05-10', '2020-02-02', '2023-07-07 10:45:00');
""")

In [7]:
mydb.commit()

In [68]:
cursor.execute("""
SELECT * FROM sqlpractice1.employees2 ;
""")

In [69]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'fancy_grid'))

╒══════════╤═════════╤══════════════╤═════════════╤═════════════════════╕
│   emp_id │ name    │ birth_date   │ hire_date   │ last_promotion      │
╞══════════╪═════════╪══════════════╪═════════════╪═════════════════════╡
│        1 │ Alice   │ 1985-06-15   │ 2015-09-10  │ 2021-09-01 10:00:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        2 │ Bob     │ 1990-11-20   │ 2018-01-15  │ 2023-01-10 09:30:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        3 │ Charlie │ 1982-03-22   │ 2010-07-11  │ 2022-06-15 11:45:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        4 │ David   │ 1995-07-30   │ 2020-12-01  │ 2023-06-30 14:15:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        5 │ Eva     │ 1987-09-12   │ 2012-03-25  │ 2022-12-22 16:50:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        6 │ Frank   │ 1988-04-18   │ 2016-06-22  │ 2023-05-10 12:00:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        7 │ Grace   │ 1983-12-25   │ 2009-05-03  │ 2021-10-01 15:20:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        8 │ Hannah  │ 1991-02-14   │ 2017-07-05  │ 2022-11-05 09:15:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│        9 │ Ivy     │ 1989-08-22   │ 2019-09-09  │ 2023-03-25 17:30:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│       10 │ Jake    │ 1992-05-10   │ 2020-02-02  │ 2023-07-07 10:45:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│       11 │ Sara    │ 1995-06-04   │ 2015-06-04  │ 2021-09-05 12:00:00 │
├──────────┼─────────┼──────────────┼─────────────┼─────────────────────┤
│       12 │ Kiara   │ 1995-07-10   │ 2018-07-10  │ 2023-01-16 11:30:00 │
╘══════════╧═════════╧══════════════╧═════════════╧═════════════════════╛

In [8]:
cursor.execute("""
INSERT INTO sqlpractice1.employees2 (emp_id,name,birth_date,hire_date,last_promotion) VALUES
(11, 'Sara', '1995-06-04', '2015-06-04', '2021-09-05 12:00:00'),
(12, 'Kiara', '1995-07-10', '2018-07-10', '2023-01-16 11:30:00');
""")

In [9]:
mydb.commit()

In [34]:
# Problem : 1 Calulate the Age of each Employee
# Hint : here we have brithdate and to calculate age we will take difference between current date and birth date in terms of years
# CURDATE = 2024-09-13
cursor.execute("""
SELECT name, TIMESTAMPDIFF(YEAR,birth_date,CURDATE()) AS age FROM sqlpractice1.employees2 ;
""")

In [35]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+-----+
|  name   | age |
+---------+-----+
|  Alice  | 39  |
|   Bob   | 33  |
| Charlie | 42  |
|  David  | 29  |
|   Eva   | 37  |
|  Frank  | 36  |
|  Grace  | 40  |
| Hannah  | 33  |
|   Ivy   | 35  |
|  Jake   | 32  |
+---------+-----+

In [36]:
query = 'SELECT name, TIMESTAMPDIFF(YEAR,birth_date,CURDATE()) AS age FROM sqlpractice1.employees2'
pd.read_sql(query,mydb)

C:\Users\admin\AppData\Local\Temp\ipykernel_12148\2727185882.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,mydb)

      name  age
0    Alice   39
1      Bob   33
2  Charlie   42
3    David   29
4      Eva   37
5    Frank   36
6    Grace   40
7   Hannah   33
8      Ivy   35
9     Jake   32

In [30]:
# Problem : 2 calculate no.of days since each employee was hired.
# hint : to calculate no.of days between two dates we will use DATEDDIFF() function.
# CURDATE = 2024-09-13
cursor.execute("""
SELECT name, DATEDIFF(CURDATE(),hire_date) AS days FROM sqlpractice1.employees2 ;
""")

In [31]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------+
|  name   | days |
+---------+------+
|  Alice  | 3291 |
|   Bob   | 2433 |
| Charlie | 5178 |
|  David  | 1382 |
|   Eva   | 4555 |
|  Frank  | 3005 |
|  Grace  | 5612 |
| Hannah  | 2627 |
|   Ivy   | 1831 |
|  Jake   | 1685 |
+---------+------+

In [32]:
# problem : 3.. List of employees who were hired in last 5 years
# hint : first we will find date that is 5 years before from today. second we will find all employess hired after this date.
# CURDATE = 2024-09-13
cursor.execute("""
SELECT emp_id,name FROM sqlpractice1.employees2 WHERE hire_date >= DATE_SUB(CURDATE(),INTERVAL 5 YEAR);
""")

In [33]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------+-------+
| emp_id | name  |
+--------+-------+
|   4    | David |
|   10   | Jake  |
+--------+-------+

In [39]:
# problem-4: find employees born in 1980s
# hint : take birth date and find employees born between 1980 - 1989

cursor.execute("""
SELECT emp_id,name,birth_date FROM sqlpractice1.employees2 WHERE YEAR(birth_date) BETWEEN 1980 AND 1989 ;
""")

In [40]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------+---------+------------+
| emp_id |  name   | birth_date |
+--------+---------+------------+
|   1    |  Alice  | 1985-06-15 |
|   3    | Charlie | 1982-03-22 |
|   5    |   Eva   | 1987-09-12 |
|   6    |  Frank  | 1988-04-18 |
|   7    |  Grace  | 1983-12-25 |
|   9    |   Ivy   | 1989-08-22 |
+--------+---------+------------+

In [54]:
# problem-5 : Display hire date in dd-mm-yyyy format
# DATE_FORMAT('date','%d-%m-%y')

cursor.execute("""
SELECT emp_id,name, DATE_FORMAT(hire_date,'%d-%m-%Y') AS hiredate_in_dd_mm_yy FROM sqlpractice1.employees2
""")

In [55]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------+---------+----------------------+
| emp_id |  name   | hiredate_in_dd_mm_yy |
+--------+---------+----------------------+
|   1    |  Alice  |      10-09-2015      |
|   2    |   Bob   |      15-01-2018      |
|   3    | Charlie |      11-07-2010      |
|   4    |  David  |      01-12-2020      |
|   5    |   Eva   |      25-03-2012      |
|   6    |  Frank  |      22-06-2016      |
|   7    |  Grace  |      03-05-2009      |
|   8    | Hannah  |      05-07-2017      |
|   9    |   Ivy   |      09-09-2019      |
|   10   |  Jake   |      02-02-2020      |
+--------+---------+----------------------+

In [73]:
#problem-6 : find the most recently promoted employee.
# hint : we will order last _promoted column in acending order and limit by 1

cursor.execute("""
SELECT emp_id,name,last_promotion FROM sqlpractice1.employees2 ORDER BY last_promotion DESC LIMIT 1;
""")

In [74]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------+------+---------------------+
| emp_id | name |   last_promotion    |
+--------+------+---------------------+
|   10   | Jake | 2023-07-07 10:45:00 |
+--------+------+---------------------+

In [76]:
# problem-7: calculate time difference in hour since last promotion.

cursor.execute("""
SELECT name,last_promotion, TIMESTAMPDIFF(HOUR,last_promotion,CURDATE()) AS HOUR_sinncelastpromotion FROM sqlpractice1.employees2;
""")

In [77]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+---------------------+--------------------------+
|  name   |   last_promotion    | HOUR_sinncelastpromotion |
+---------+---------------------+--------------------------+
|  Alice  | 2021-09-01 10:00:00 |          26582           |
|   Bob   | 2023-01-10 09:30:00 |          14678           |
| Charlie | 2022-06-15 11:45:00 |          19692           |
|  David  | 2023-06-30 14:15:00 |          10569           |
|   Eva   | 2022-12-22 16:50:00 |          15127           |
|  Frank  | 2023-05-10 12:00:00 |          11796           |
|  Grace  | 2021-10-01 15:20:00 |          25856           |
| Hannah  | 2022-11-05 09:15:00 |          16262           |
|   Ivy   | 2023-03-25 17:30:00 |          12894           |
|  Jake   | 2023-07-07 10:45:00 |          10405           |
+---------+---------------------+--------------------------+

In [80]:
# problem-8: find an employee who had promotion this year --> WHERE YEAR(last_promotion) = YEAR(CURDATE()) but
# there is no one who is promoted this year in 2024 so we will use 2023 

cursor.execute("""
SELECT name,last_promotion FROM sqlpractice1.employees2 WHERE YEAR(last_promotion) = 2023;
""")

In [81]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-------+---------------------+
| name  |   last_promotion    |
+-------+---------------------+
|  Bob  | 2023-01-10 09:30:00 |
| David | 2023-06-30 14:15:00 |
| Frank | 2023-05-10 12:00:00 |
|  Ivy  | 2023-03-25 17:30:00 |
| Jake  | 2023-07-07 10:45:00 |
+-------+---------------------+

In [96]:
# problem-9: calculate next anniversy of hir date of each employee
cursor.execute("""
SELECT name,hire_date, 
       DATE_ADD(hire_date, INTERVAL TIMESTAMPDIFF(YEAR, hire_date, CURDATE()) + 1 YEAR) AS next_anniversary
FROM sqlpractice1.employees2;
""")
# explaination :
# syntax of DAT_ADD('date' INTERVAL value unit)..for example DATE_ADD('2024-09-13' INTERVAL +5 YEAR)..output : 2029-09-13
# here output of TIMESTAMPDIFF(YEAR,hire_date,CURDATE()) for hire_date (2015-09-10),CURDATE(2024-13-09) will be 9 years
# so DATE_ADD(hire_date, INTERVAL 10 YEAR) so output for 2015-09-10 will be 2025-09-10

In [97]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+------------------+
|  name   | hire_date  | next_anniversary |
+---------+------------+------------------+
|  Alice  | 2015-09-10 |    2025-09-10    |
|   Bob   | 2018-01-15 |    2025-01-15    |
| Charlie | 2010-07-11 |    2025-07-11    |
|  David  | 2020-12-01 |    2024-12-01    |
|   Eva   | 2012-03-25 |    2025-03-25    |
|  Frank  | 2016-06-22 |    2025-06-22    |
|  Grace  | 2009-05-03 |    2025-05-03    |
| Hannah  | 2017-07-05 |    2025-07-05    |
|   Ivy   | 2019-09-09 |    2025-09-09    |
|  Jake   | 2020-02-02 |    2025-02-02    |
+---------+------------+------------------+

In [100]:

# -----------------------------------> TOP BIG TECH COMPANY INTERVIEW QUESTIONS <------------------------------

In [8]:
# problem -1 : Calculate the Median Hire Date of Employees (Uber, Amazon)
cursor.execute("""
SELECT hire_date
FROM sqlpractice1.employees2
ORDER BY hire_date ;
""")

In [9]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+------------+
| hire_date  |
+------------+
| 2009-05-03 |
| 2010-07-11 |
| 2012-03-25 |
| 2015-09-10 |
| 2016-06-22 |
| 2017-07-05 |
| 2018-01-15 |
| 2019-09-09 |
| 2020-02-02 |
| 2020-12-01 |
+------------+

In [ ]:
"""
Manual Calculation:
Convert the dates to Unix timestamps.
Calculate the average of these timestamps.
Convert the average timestamp back to a date format.
For the given data:

2016-06-22 is approximately 1466553600 (Unix timestamp).
2017-07-05 is approximately 1499212800 (Unix timestamp).
Average timestamp: 
Average
=(1466553600+1499212800)/2=1482883200

Convert the average timestamp back to a date:

Average date: 2017-03-01
"""

In [6]:
# this is the solution to find median date from above last ouput of ordered dates 
cursor.execute("""
WITH ranked_employees AS (
    SELECT hire_date,
           ROW_NUMBER() OVER (ORDER BY hire_date) AS row_num,
           COUNT(*) OVER () AS total_rows
    FROM sqlpractice1.employees2
)
SELECT AVG(UNIX_TIMESTAMP(hire_date)) AS median_hire_date
FROM ranked_employees
WHERE row_num IN (FLOOR((total_rows + 1) / 2), CEIL((total_rows + 1) / 2));
""")

In [7]:
cursor.fetchall()

[(Decimal('1482876000.0000'),)]

In [18]:
cursor.execute("""
SELECT FROM_UNIXTIME(1482876000);
""")

In [19]:
print(tabulate(cursor.fetchall(),headers = ['median_date'],tablefmt = 'pretty'))

+---------------------+
|     median_date     |
+---------------------+
| 2016-12-27 23:00:00 |
+---------------------+

In [31]:
# problem : 2 Find the Average Time Between Promotions (Google, Facebook)
cursor.execute("""
SELECT AVG(DATEDIFF(last_promotion, hire_date)) AS days_between_promotion
FROM sqlpractice1.employees2;
""")

In [32]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+------------------------+
| days_between_promotion |
+------------------------+
|       2476.6000        |
+------------------------+

In [29]:
cursor.execute("""
SELECT 
    AVG(TIMESTAMPDIFF(DAY, hire_date, last_promotion)) AS avg_days_between_promotions,
    AVG(TIMESTAMPDIFF(MONTH, hire_date, last_promotion)) AS avg_months_between_promotions,
    AVG(TIMESTAMPDIFF(YEAR, hire_date, last_promotion)) AS avg_years_between_promotions
FROM sqlpractice1.employees2;
""")

In [30]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-----------------------------+-------------------------------+------------------------------+
| avg_days_between_promotions | avg_months_between_promotions | avg_years_between_promotions |
+-----------------------------+-------------------------------+------------------------------+
|          2476.6000          |            80.8000            |            6.1000            |
+-----------------------------+-------------------------------+------------------------------+

In [37]:
# problem : 3.. find the one employee with longest Tenure(oldest or working longest).
# Write a query to find the employee who has been working the longest (i.e., the one with the earliest hire date).
cursor.execute("""
SELECT name,hire_date
FROM sqlpractice1.employees2
ORDER BY hire_date ASC 
LIMIT 1 ;
""")

In [38]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-------+------------+
| name  | hire_date  |
+-------+------------+
| Grace | 2009-05-03 |
+-------+------------+

In [44]:
# problem : 4 Calculate the Percentage of Employees Hired Each Year (Facebook, Apple)
cursor.execute("""
SELECT YEAR(hire_date) AS hire_year,
       COUNT(*) * 100.0 / (SELECT COUNT(*) FROM sqlpractice1.employees2) AS percentage_hired
FROM sqlpractice1.employees2
GROUP BY hire_year;
""")

In [45]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-----------+------------------+
| hire_year | percentage_hired |
+-----------+------------------+
|   2015    |     10.00000     |
|   2018    |     10.00000     |
|   2010    |     10.00000     |
|   2020    |     20.00000     |
|   2012    |     10.00000     |
|   2016    |     10.00000     |
|   2009    |     10.00000     |
|   2017    |     10.00000     |
|   2019    |     10.00000     |
+-----------+------------------+

In [66]:
# problem : 5 Identify Employees Who Were Hired on the Same Day as Their Birthdate (Netflix)

cursor.execute("""
SELECT * FROM sqlpractice1.employees2 WHERE DATE_FORMAT(birth_date,'%m-%d') = DATE_FORMAT(hire_date,'%m-%d');
""")

In [67]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'fancy_grid'))

╒══════════╤════════╤══════════════╤═════════════╤═════════════════════╕
│   emp_id │ name   │ birth_date   │ hire_date   │ last_promotion      │
╞══════════╪════════╪══════════════╪═════════════╪═════════════════════╡
│       11 │ Sara   │ 1995-06-04   │ 2015-06-04  │ 2021-09-05 12:00:00 │
├──────────┼────────┼──────────────┼─────────────┼─────────────────────┤
│       12 │ Kiara  │ 1995-07-10   │ 2018-07-10  │ 2023-01-16 11:30:00 │
╘══════════╧════════╧══════════════╧═════════════╧═════════════════════╛

In [70]:
# problem: 6 Find Employees Who Were Hired on a Weekend (Google, Uber)
cursor.execute("""
SELECT name, hire_date
FROM sqlpractice1.employees2
WHERE DAYOFWEEK(hire_date) IN (1, 7); 
""")

In [71]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+
|  name   | hire_date  |
+---------+------------+
| Charlie | 2010-07-11 |
|   Eva   | 2012-03-25 |
|  Grace  | 2009-05-03 |
|  Jake   | 2020-02-02 |
+---------+------------+

In [72]:
# problem : 7 Calculate the Average Age of Employees When Hired (Apple, Facebook)
cursor.execute("""
SELECT AVG(TIMESTAMPDIFF(YEAR, birth_date, hire_date)) AS avg_age_at_hiring
FROM sqlpractice1.employees2;
""")

In [73]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-------------------+
| avg_age_at_hiring |
+-------------------+
|      26.0833      |
+-------------------+

In [74]:
# problem : 8 Identify Employees Who Were Hired Within the Last N Days (Amazon, Uber)
# Find employees who were hired in the last 30 days (change the number as needed)
cursor.execute("""
SELECT name, hire_date
FROM sqlpractice1.employees2
WHERE hire_date >= DATE_SUB(CURDATE(), INTERVAL 30 DAY);
""")

In [75]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+------+-----------+
| name | hire_date |
+------+-----------+
+------+-----------+

In [78]:
# problem : 9 Find Employees Who Were Hired Exactly 5 Years Ago from Today (Microsoft, Google)
cursor.execute("""
SELECT name, hire_date
FROM sqlpractice1.employees2
WHERE hire_date = DATE_SUB(CURDATE(), INTERVAL 10 YEAR);
""")

In [79]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+------+-----------+
| name | hire_date |
+------+-----------+
+------+-----------+

In [80]:
# problem : 10 Rank Employees by Time Since Last Promotion (Netflix, Uber)
# Rank employees by the number of days since their last promotion, with the most recently promoted employees first.
cursor.execute("""
SELECT name, last_promotion,
       DATEDIFF(CURDATE(), last_promotion) AS days_since_promotion,
       RANK() OVER (ORDER BY last_promotion DESC) AS promotion_rank
FROM sqlpractice1.employees2;
""")

In [81]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+---------------------+----------------------+----------------+
|  name   |   last_promotion    | days_since_promotion | promotion_rank |
+---------+---------------------+----------------------+----------------+
|  Jake   | 2023-07-07 10:45:00 |         437          |       1        |
|  David  | 2023-06-30 14:15:00 |         444          |       2        |
|  Frank  | 2023-05-10 12:00:00 |         495          |       3        |
|   Ivy   | 2023-03-25 17:30:00 |         541          |       4        |
|  Kiara  | 2023-01-16 11:30:00 |         609          |       5        |
|   Bob   | 2023-01-10 09:30:00 |         615          |       6        |
|   Eva   | 2022-12-22 16:50:00 |         634          |       7        |
| Hannah  | 2022-11-05 09:15:00 |         681          |       8        |
| Charlie | 2022-06-15 11:45:00 |         824          |       9        |
|  Grace  | 2021-10-01 15:20:00 |         1081         |       10       |
|  Sara   | 2021-09-05 12:00:00 |         1107         |       11       |
|  Alice  | 2021-09-01 10:00:00 |         1111         |       12       |
+---------+---------------------+----------------------+----------------+

In [ ]:
"""
Explanation of Importance in These Companies:

Google: Companies like Google often test candidates on their ability to optimize SQL queries, 
        especially when dealing with large datasets involving dates and times.
        
Amazon: Operational efficiency and logistics often require employees to manage and analyze data with various time constraints.

Microsoft: Candidates are expected to manage historical data effectively and manipulate date-based records.

Uber: Handling time-sensitive events, such as ride pickups and drop-offs, makes date and time manipulation crucial.

Netflix: Content release schedules and viewership analytics require precision in calculating intervals and deadlines.

Apple: Apple emphasizes employee productivity and performance, 
       which makes tracking promotions, tenure, and work anniversaries a key focus.
       
Facebook: Handling massive datasets, such as user activities with timestamps, 
          makes efficient use of date and time functions necessary.
"""